import { createStore } from 'vuex'

export default createStore({
  state: {
    allData: [
      {
        "type": "trash",
        "address": "Мин-куш",
        "coords": [
          42.87344808444721,
          74.60729598999023
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87042872752173,
          74.60866928100586
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87017710777703,
          74.62411880493164
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.859356488383945,
          74.58824157714844
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87401419742621,
          74.59914207458496
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.874706106237205,
          74.61630821228026
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86841574084276,
          74.61381912231445
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86633977957154,
          74.60626602172852
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          74.61021423339844,
          42.868981899981655
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86659141495917,
          74.61175918579102
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.862565125665874,
          74.61030006408691
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.862565125665874,
          74.61030006408691
        ]
      }
    ],
    trashes: [
      {
        "type": "trash",
        "address": "Мин-куш",
        "coords": [
          42.87344808444721,
          74.60729598999023
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87042872752173,
          74.60866928100586
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87017710777703,
          74.62411880493164
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.859356488383945,
          74.58824157714844
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87401419742621,
          74.59914207458496
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.874706106237205,
          74.61630821228026
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86841574084276,
          74.61381912231445
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86633977957154,
          74.60626602172852
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          74.61021423339844,
          42.868981899981655
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86659141495917,
          74.61175918579102
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.862565125665874,
          74.61030006408691
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.862565125665874,
          74.61030006408691
        ]
      }
    ],
    waste: [
      {
        "type": "trash",
        "address": "Мин-куш",
        "coords": [
          42.87344808444721,
          74.60729598999023
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87042872752173,
          74.60866928100586
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87017710777703,
          74.62411880493164
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.859356488383945,
          74.58824157714844
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.87401419742621,
          74.59914207458496
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.874706106237205,
          74.61630821228026
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86841574084276,
          74.61381912231445
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86633977957154,
          74.60626602172852
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          74.61021423339844,
          42.868981899981655
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.86659141495917,
          74.61175918579102
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.862565125665874,
          74.61030006408691
        ]
      },
      {
        "type": "trash",
        "address": "Нарын",
        "coords": [
          42.862565125665874,
          74.61030006408691
        ]
      }
    ],
    selectedId: '',
  },
  getters: {
  },
  mutations: {
  },
  actions: {
  },
  modules: {
  }
})
